{"id":"d33df989-4845-4acd-9220-858dbc67efe0","updated_at":"2024-12-11T01:14:12.939Z","updated_by":"1088490702","created_at":"2024-12-11T01:07:57.882Z","created_by":"1088490702","name":"nmap scan","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"nmap scan detection","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://my-deployment-4f9575.kb.asia-southeast2.gcp.elastic-cloud.com/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"6e78fd1c-8ee6-4765-8563-bba197ae6763","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.action: \"nmap_scan\"","filters":[],"actions":[{"id":"elastic-cloud-email","params":{"message":"Rule {{context.rule.name}} generated {{state.signals_count}} alerts","to":["jakafirdaus1509@gmail.com"],"subject":"elastic SIEM alert "},"action_type_id":".email","uuid":"6a604f54-4153-427f-9770-4a4f732b7299","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
